#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.main: Refreshing state... [id=vpc-0019a2de5322a3397]
data.aws_availability_zones.all: Reading...
aws_ssm_parameter.foo: Refreshing state... [id=foo]
aws_iam_role.role-launch-ec2: Refreshing state... [id=role-launch-ec2]
aws_iam_instance_profile.ec2-instance-profile: Refreshing state... [id=ec2_instance_profile]
data.aws_availability_zones.all: Read complete after 2s [id=us-east-1]
aws_internet_gateway.igw: Refreshing state... [id=igw-0ac123e9b2f9f6dc9]
aws_subnet.private-subnet[2]: Refreshing state... [id=subnet-04907e983cda8b829]
aws_subnet.public-subnet[0]: Refreshing state... [id=subnet-0a038ffe273e528cf]
aws_subnet.private-subnet[3]: Refreshing state... [id=subnet-0913fab23c6fc946e]
data.aws_subnet_ids.public_subnets: Reading...
aws_subnet.private-subnet[5]: Refreshing state... [id=subnet-0a30a8a1ceddedc4d]
aws_subnet.private-subnet[4]: Refreshing state... [id=subnet-04515c5c0cc6a3b7c]
aws_subnet.private-subnet[0]: Refreshing state... [id=subnet-098d6efe9b7c412e0]
aws_subnet.private-subnet[1]: Refreshing state... [id=subnet-04dbb45a2d8b3f2b0]
aws_security_group.sg: Refreshing state... [id=sg-0ecf005d25660f34a]
aws_subnet.public-subnet[1]: Refreshing state... [id=subnet-084b421443cfcb750]
aws_subnet.public-subnet[2]: Refreshing state... [id=subnet-02d15ccd3b52e5319]
aws_subnet.public-subnet[3]: Refreshing state... [id=subnet-0086c7e08f9686a98]
aws_subnet.public-subnet[4]: Refreshing state... [id=subnet-08e6078c1c8efdfdd]
data.aws_subnet_ids.public_subnets: Read complete after 0s [id=vpc-0019a2de5322a3397]
aws_subnet.public-subnet[5]: Refreshing state... [id=subnet-0b6f663793f911886]
aws_route.public_subnets_igw[2]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[5]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[3]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[4]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[0]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[1]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_instance.ec2_instance[5]: Refreshing state... [id=i-08d1ffdd8ed21d4af]
aws_instance.ec2_instance: Refreshing state... [id=i-0787bfa9ce8790602]
aws_instance.ec2_instance[1]: Refreshing state... [id=i-015ad917fa9603c8e]
aws_instance.ec2_instance[2]: Refreshing state... [id=i-0691587c5af850312]
aws_instance.ec2_instance[3]: Refreshing state... [id=i-02c7afd4c3a51755c]
aws_instance.ec2_instance[4]: Refreshing state... [id=i-0f5e18fcee3f1c078]
aws_route_table_association.public_subnets_association[5]: Refreshing state... [id=rtbassoc-0802b8fa82971a529]
aws_route_table_association.public_subnets_association[0]: Refreshing state... [id=rtbassoc-008c4bd80a2938c9f]
aws_route_table_association.public_subnets_association[1]: Refreshing state... [id=rtbassoc-0fac2590760fc4c4b]
aws_route_table_association.public_subnets_association[2]: Refreshing state... [id=rtbassoc-0e0468fb16730045c]
aws_route_table_association.public_subnets_association[3]: Refreshing state... [id=rtbassoc-0e0f58fc63e546404]
aws_route_table_association.public_subnets_association[4]: Refreshing state... [id=rtbassoc-0a29256b27cc8d765]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_elb will be created
  + resource "aws_autoscaling_attachment" "asg_elb" {
      + autoscaling_group_name = (known after apply)
      + elb                    = "remix-recipe-server-elb"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "us-east-1a",
          + "us-east-1b",
          + "us-east-1c",
          + "us-east-1d",
          + "us-east-1e",
          + "us-east-1f",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_size                  = 10
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "remix-recipe-server-asg"
        }
    }

  # aws_elb.elb will be created
  + resource "aws_elb" "elb" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "us-east-1a",
          + "us-east-1b",
          + "us-east-1c",
          + "us-east-1d",
          + "us-east-1e",
          + "us-east-1f",
        ]
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + desync_mitigation_mode      = "defensive"
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = false
      + name                        = "remix-recipe-server-elb"
      + security_groups             = [
          + "sg-0ecf005d25660f34a",
        ]
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = {
          + "Environment" = "Production"
          + "Name"        = "remix-recipe-server-elb"
          + "Owner"       = "Shubham"
        }
      + tags_all                    = {
          + "Environment" = "Production"
          + "Name"        = "remix-recipe-server-elb"
          + "Owner"       = "Shubham"
        }
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 3
          + interval            = 30
          + target              = "HTTP:80/"
          + timeout             = 3
          + unhealthy_threshold = 5
        }

      + listener {
          + instance_port     = 80
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_instance.ec2_instance must be replaced
  # (moved from aws_instance.ec2_instance[0])
-/+ resource "aws_instance" "ec2_instance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:619568494776:instance/i-0787bfa9ce8790602" -> (known after apply)
      ~ associate_public_ip_address          = true -> false # forces replacement
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0787bfa9ce8790602" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0b7cf55edcd3496d6" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-214.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.214" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "44.193.25.56" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ subnet_id                            = "subnet-0a038ffe273e528cf" -> "subnet-098d6efe9b7c412e0" # forces replacement
      ~ tags                                 = {
          ~ "Name"        = "remix-recipe-nginx-instance-1" -> "remix-recipe-prod-instance"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                             = {
          ~ "Name"        = "remix-recipe-nginx-instance-1" -> "remix-recipe-prod-instance"
            # (2 unchanged elements hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0e07def7b3bc039ed" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # aws_instance.ec2_instance[1] will be destroyed
  # (because resource does not use count)
  - resource "aws_instance" "ec2_instance" {
      - ami                                  = "ami-0323c3dd2da7fb37d" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:619568494776:instance/i-015ad917fa9603c8e" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-015ad917fa9603c8e" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0b384a9eabac072e2" -> null
      - private_dns                          = "ip-10-0-2-5.ec2.internal" -> null
      - private_ip                           = "10.0.2.5" -> null
      - public_ip                            = "3.91.208.198" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-084b421443cfcb750" -> null
      - tags                                 = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-nginx-instance-2"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                             = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-nginx-instance-2"
          - "Owner"       = "Shubham"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "1730b2b79f7734dee81cdeef1620aef2181e1cac" -> null
      - vpc_security_group_ids               = [
          - "sg-0ecf005d25660f34a",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-05feeb9933ff6b50d" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.ec2_instance[2] will be destroyed
  # (because resource does not use count)
  - resource "aws_instance" "ec2_instance" {
      - ami                                  = "ami-0323c3dd2da7fb37d" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:619568494776:instance/i-0691587c5af850312" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-0691587c5af850312" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-083e8517af3c5d4e9" -> null
      - private_dns                          = "ip-10-0-3-90.ec2.internal" -> null
      - private_ip                           = "10.0.3.90" -> null
      - public_ip                            = "18.208.248.75" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-02d15ccd3b52e5319" -> null
      - tags                                 = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-nginx-instance-3"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                             = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-nginx-instance-3"
          - "Owner"       = "Shubham"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "1730b2b79f7734dee81cdeef1620aef2181e1cac" -> null
      - vpc_security_group_ids               = [
          - "sg-0ecf005d25660f34a",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-02f7c7fe6abf09a85" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.ec2_instance[3] will be destroyed
  # (because resource does not use count)
  - resource "aws_instance" "ec2_instance" {
      - ami                                  = "ami-0323c3dd2da7fb37d" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:619568494776:instance/i-02c7afd4c3a51755c" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1d" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-02c7afd4c3a51755c" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-00f5c2777fa6d3ec4" -> null
      - private_dns                          = "ip-10-0-4-62.ec2.internal" -> null
      - private_ip                           = "10.0.4.62" -> null
      - public_ip                            = "52.91.237.227" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0086c7e08f9686a98" -> null
      - tags                                 = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-nginx-instance-4"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                             = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-nginx-instance-4"
          - "Owner"       = "Shubham"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "1730b2b79f7734dee81cdeef1620aef2181e1cac" -> null
      - vpc_security_group_ids               = [
          - "sg-0ecf005d25660f34a",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-06c0c9ebfddbc9114" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.ec2_instance[4] will be destroyed
  # (because resource does not use count)
  - resource "aws_instance" "ec2_instance" {
      - ami                                  = "ami-0323c3dd2da7fb37d" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:619568494776:instance/i-0f5e18fcee3f1c078" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1e" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-0f5e18fcee3f1c078" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0792d1a8dfbd752ea" -> null
      - private_dns                          = "ip-10-0-5-221.ec2.internal" -> null
      - private_ip                           = "10.0.5.221" -> null
      - public_ip                            = "52.3.251.14" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-08e6078c1c8efdfdd" -> null
      - tags                                 = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-nginx-instance-5"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                             = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-nginx-instance-5"
          - "Owner"       = "Shubham"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "1730b2b79f7734dee81cdeef1620aef2181e1cac" -> null
      - vpc_security_group_ids               = [
          - "sg-0ecf005d25660f34a",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0173f5697c6ec3f89" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.ec2_instance[5] will be destroyed
  # (because resource does not use count)
  - resource "aws_instance" "ec2_instance" {
      - ami                                  = "ami-0323c3dd2da7fb37d" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:619568494776:instance/i-08d1ffdd8ed21d4af" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1f" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-08d1ffdd8ed21d4af" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0ca414a129a2cfc6e" -> null
      - private_dns                          = "ip-10-0-6-133.ec2.internal" -> null
      - private_ip                           = "10.0.6.133" -> null
      - public_ip                            = "3.80.232.220" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0b6f663793f911886" -> null
      - tags                                 = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-nginx-instance-6"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                             = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-nginx-instance-6"
          - "Owner"       = "Shubham"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "1730b2b79f7734dee81cdeef1620aef2181e1cac" -> null
      - vpc_security_group_ids               = [
          - "sg-0ecf005d25660f34a",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0b2b1b7885b02b817" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_launch_configuration.alc will be created
  + resource "aws_launch_configuration" "alc" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0323c3dd2da7fb37d"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = (known after apply)
      + security_groups             = [
          + "sg-0ecf005d25660f34a",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shubhamcommits, Action: `pull_request`*